byAlex_regularPorousMedia-master/twoPhase/incompressible/channelWithRectangleObstacle/3D/src/constant/src/transportProperties.0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          ( phase1 phase2 );

phase1
{
    transportModel  Newtonian;
    nu              1e-02;
    rho             900;
}

phase2
{
    transportModel  Newtonian;
    nu              1e-02;
    rho             1000;
}

sigma           0.046;

// channelLength   channelLength [ 0 1 0 0 0 0 0 ] 0;


// ************************************************************************* //
