byAlex_regularPorousMedia-master/twoPhase/incompressible/channelWithRectangleObstacle/3D/src/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    left
    {
        type            noSlip;

//         type            inletOutlet;
//         inletValue      uniform (0 0 0);
//         value           uniform (0 0 0);

//         type            zeroGradient;
    }

    right
    {
        type            noSlip;

//         type                flowRateInletVelocity;
//         volumetricFlowRate  table
//         (
//             (0          0)
//             (0.1        0)
//             (0.100001   5e-10)
//             (10.0       5e-10)
//         );
//         extrapolateProfile  yes;
//         value               uniform (0 0 0);

//         type            zeroGradient;
    }

    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
