byAlex_regularPorousMedia-master/twoPhase/incompressible/channelWithRectangleObstacle/3D/src/system/snappyHexMeshSrc/STL_list
splittedChannel.stl
{
    type triSurfaceMesh;
    name splittedChannel;
}
splittedChannelWalls.stl
{
    type triSurfaceMesh;
    name splittedChannelWalls;
}
