byAlex_regularPorousMedia-master/twoPhase/incompressible/channelWithRectangleObstacle/3D/src/system/snappyHexMeshSrc/eMesh_list
{
    file "splittedChannel.eMesh";
    level 0;
}
