byAlex_regularPorousMedia-master/twoPhase/incompressible/channelWithRectangleObstacle/3D/src/system/snappyHexMeshSrc/refinementSurfaces_list
splittedChannelWalls
{
    level (1 1);
    patchInfo{type wall;}
}
